In [62]:
import pandas as pd
import numpy as np

In [63]:
data=np.random.randn(4,3)

In [64]:
data

array([[ 0.35100464,  0.22222067, -1.716542  ],
       [-0.28178448, -1.45069819, -1.27550439],
       [ 0.11211372,  0.22838683,  0.36171837],
       [ 0.11014682,  0.45720549,  0.52959688]])

In [65]:
dataFrame=pd.DataFrame(data)

In [66]:
dataFrame

          0         1         2
0  0.351005  0.222221 -1.716542
1 -0.281784 -1.450698 -1.275504
2  0.112114  0.228387  0.361718
3  0.110147  0.457205  0.529597

In [67]:
dataFrame[0]

0    0.351005
1   -0.281784
2    0.112114
3    0.110147
Name: 0, dtype: float64

In [68]:
yeniDataFrame=pd.DataFrame(data,index=["Atil","Zeynep","Atlas","Mehmet"],columns=["Maas","Yas","Calisma Saati"])

In [69]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atil    0.351005  0.222221      -1.716542
Zeynep -0.281784 -1.450698      -1.275504
Atlas   0.112114  0.228387       0.361718
Mehmet  0.110147  0.457205       0.529597

In [70]:
yeniDataFrame["Yas"]

Atil      0.222221
Zeynep   -1.450698
Atlas     0.228387
Mehmet    0.457205
Name: Yas, dtype: float64

In [71]:
yeniDataFrame["Calisma Saati"]

Atil     -1.716542
Zeynep   -1.275504
Atlas     0.361718
Mehmet    0.529597
Name: Calisma Saati, dtype: float64

In [72]:
yeniDataFrame[["Maas","Yas"]]

            Maas       Yas
Atil    0.351005  0.222221
Zeynep -0.281784 -1.450698
Atlas   0.112114  0.228387
Mehmet  0.110147  0.457205

In [73]:
yeniDataFrame.loc["Atil"]

Maas             0.351005
Yas              0.222221
Calisma Saati   -1.716542
Name: Atil, dtype: float64

In [74]:
yeniDataFrame.iloc[1]

Maas            -0.281784
Yas             -1.450698
Calisma Saati   -1.275504
Name: Zeynep, dtype: float64

In [75]:
# yeni kolon ekleme

In [76]:
yeniDataFrame["Emeklilik Yasi"] =yeniDataFrame["Yas"]*2

In [77]:
yeniDataFrame

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Atil    0.351005  0.222221      -1.716542        0.444441
Zeynep -0.281784 -1.450698      -1.275504       -2.901396
Atlas   0.112114  0.228387       0.361718        0.456774
Mehmet  0.110147  0.457205       0.529597        0.914411

In [78]:
#kolon silme x ekseni=0  y ekseni=1

In [79]:
yeniDataFrame.drop("Emeklilik Yasi",axis=1)

            Maas       Yas  Calisma Saati
Atil    0.351005  0.222221      -1.716542
Zeynep -0.281784 -1.450698      -1.275504
Atlas   0.112114  0.228387       0.361718
Mehmet  0.110147  0.457205       0.529597

In [80]:
yeniDataFrame.drop("Mehmet",axis=0)

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Atil    0.351005  0.222221      -1.716542        0.444441
Zeynep -0.281784 -1.450698      -1.275504       -2.901396
Atlas   0.112114  0.228387       0.361718        0.456774

In [81]:
yeniDataFrame.drop("Emeklilik Yasi",axis=1, inplace=True)

In [82]:
yeniDataFrame.loc["Atil"]["Yas"]

0.22222067122959357

In [83]:
yeniDataFrame.loc["Zeynep","Maas"]

-0.28178447503438603

In [84]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atil    0.351005  0.222221      -1.716542
Zeynep -0.281784 -1.450698      -1.275504
Atlas   0.112114  0.228387       0.361718
Mehmet  0.110147  0.457205       0.529597

In [85]:
booleanFrame=yeniDataFrame <0

In [86]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atil    0.351005  0.222221      -1.716542
Zeynep -0.281784 -1.450698      -1.275504
Atlas   0.112114  0.228387       0.361718
Mehmet  0.110147  0.457205       0.529597

In [87]:
yeniDataFrame[booleanFrame]  #sadece sifirdan  küçük olan değerleri gösterir

            Maas       Yas  Calisma Saati
Atil         NaN       NaN      -1.716542
Zeynep -0.281784 -1.450698      -1.275504
Atlas        NaN       NaN            NaN
Mehmet       NaN       NaN            NaN

In [88]:
yeniDataFrame[yeniDataFrame["Yas"] > 0] #rowlardan yaşı sıfırdan büyük olanları getir dedik;

            Maas       Yas  Calisma Saati
Atil    0.351005  0.222221      -1.716542
Atlas   0.112114  0.228387       0.361718
Mehmet  0.110147  0.457205       0.529597

In [89]:
yeniDataFrame[yeniDataFrame < 0]

            Maas       Yas  Calisma Saati
Atil         NaN       NaN      -1.716542
Zeynep -0.281784 -1.450698      -1.275504
Atlas        NaN       NaN            NaN
Mehmet       NaN       NaN            NaN

In [90]:
yeniDataFrame.reset_index()

    index      Maas       Yas  Calisma Saati
0    Atil  0.351005  0.222221      -1.716542
1  Zeynep -0.281784 -1.450698      -1.275504
2   Atlas  0.112114  0.228387       0.361718
3  Mehmet  0.110147  0.457205       0.529597

In [91]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atil    0.351005  0.222221      -1.716542
Zeynep -0.281784 -1.450698      -1.275504
Atlas   0.112114  0.228387       0.361718
Mehmet  0.110147  0.457205       0.529597

In [92]:
yeniIndeksListesi=["Ati","Zey","Atl","Meh"]

In [93]:
yeniDataFrame["Yeni Index"]=yeniIndeksListesi

In [94]:
yeniDataFrame

            Maas       Yas  Calisma Saati Yeni Index
Atil    0.351005  0.222221      -1.716542        Ati
Zeynep -0.281784 -1.450698      -1.275504        Zey
Atlas   0.112114  0.228387       0.361718        Atl
Mehmet  0.110147  0.457205       0.529597        Meh

In [95]:
yeniDataFrame.set_index("Yeni Index")

                Maas       Yas  Calisma Saati
Yeni Index
Ati         0.351005  0.222221      -1.716542
Zey        -0.281784 -1.450698      -1.275504
Atl         0.112114  0.228387       0.361718
Meh         0.110147  0.457205       0.529597

In [96]:
yeniDataFrame.set_index("Yeni Index",inplace=True)

In [97]:
yeniDataFrame.loc["Ati"]

Maas             0.351005
Yas              0.222221
Calisma Saati   -1.716542
Name: Ati, dtype: float64

In [98]:
ilkIndeksler=["Simpson","Simpson","Simpson","South Park","South Park","South Park"]

In [99]:
icIndeksler= ["Homer","Bart","Marge","Cartman","Kenny","Kyle"]

In [100]:
birlesmisIndeks=list(zip(ilkIndeksler,icIndeksler))

In [101]:
birlesmisIndeks

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [104]:
birlesmisIndeks=pd.MultiIndex.from_tuples(birlesmisIndeks)

In [106]:
birlesmisIndeks

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [112]:
benimcizgiFilmListem=[[40,"A"],[50,"B"],[15,"C"],[30,"D"],[10,"E"],[11,"F"]]

In [113]:
cizgiFilmNumpyDizisi=np.array(benimcizgiFilmListem)

In [115]:
cizgiFilmDataFrame=pd.DataFrame(cizgiFilmNumpyDizisi,index=birlesmisIndeks,columns=["Yas","Meslek"])

In [116]:
cizgiFilmDataFrame

                   Yas Meslek
Simpson    Homer    40      A
           Bart     50      B
           Marge    15      C
South Park Cartman  30      D
           Kenny    10      E
           Kyle     11      F

In [117]:
cizgiFilmDataFrame.loc["Simpson"]

      Yas Meslek
Homer  40      A
Bart   50      B
Marge  15      C

In [120]:
cizgiFilmDataFrame.loc["South Park","Kenny"]

Yas       10
Meslek     E
Name: (South Park, Kenny), dtype: object

In [121]:
cizgiFilmDataFrame.index.names= ["Film Adı","isim"]

In [122]:
cizgiFilmDataFrame

                   Yas Meslek
Film Adı   isim
Simpson    Homer    40      A
           Bart     50      B
           Marge    15      C
South Park Cartman  30      D
           Kenny    10      E
           Kyle     11      F